---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.HasEmbeddedSchedule
source: html/5d6d98b0-6c2f-e6c4-c888-a85776657e61.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.HasEmbeddedSchedule Property

Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.

## Syntax (C#)
```csharp
public bool HasEmbeddedSchedule { get; }
```